{
  "add_cross_attention": false,
  "architectures": [
    "RobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Majority_Positive",
    "1": "Minority_Peer_Experience",
    "2": "Negative_Attitude",
    "3": "Negative_Communication",
    "4": "Negative_Contribution",
    "5": "Negative_Reliability",
    "6": "Self_Minority_Reveal",
    "7": "Self_Positive",
    "8": "Self_Struggle",
    "9": "Self_Suggestion",
    "10": "Suggestion_To_Peer"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "Majority_Positive": 0,
    "Minority_Peer_Experience": 1,
    "Negative_Attitude": 2,
    "Negative_Communication": 3,
    "Negative_Contribution": 4,
    "Negative_Reliability": 5,
    "Self_Minority_Reveal": 6,
    "Self_Positive": 7,
    "Self_Struggle": 8,
    "Self_Suggestion": 9,
    "Suggestion_To_Peer": 10
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 6,
  "pad_token_id": 1,
  "tie_word_embeddings": true,
  "transformers_version": "5.9.0",
  "type_vocab_size": 1,
  "use_cache": false,
  "vocab_size": 50265
}
