{
  "add_cross_attention": false,
  "architectures": [
    "RobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Constructive",
    "1": "Negative_Communication",
    "2": "Negative_Contribution",
    "3": "Negative_Reliability",
    "4": "Positive_Communication",
    "5": "Positive_Contribution",
    "6": "Positive_Leadership",
    "7": "Positive_Reliability"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "Constructive": 0,
    "Negative_Communication": 1,
    "Negative_Contribution": 2,
    "Negative_Reliability": 3,
    "Positive_Communication": 4,
    "Positive_Contribution": 5,
    "Positive_Leadership": 6,
    "Positive_Reliability": 7
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 6,
  "pad_token_id": 1,
  "tie_word_embeddings": true,
  "transformers_version": "5.9.0",
  "type_vocab_size": 1,
  "use_cache": false,
  "vocab_size": 50265
}
